---
type: VertexStreamPosition
namespace: Autodesk.Revit.DB.DirectContext3D
version: 2024
members: 2
tags: [revit-api, class]
---

# VertexStreamPosition

`Autodesk.Revit.DB.DirectContext3D.VertexStreamPosition` · Revit 2024 · 2 members

| Kind | Member | Since | Signature |
| --- | --- | --- | --- |
| Method | AddVertex | 2017 | `public void AddVertex ( VertexPosition vertex )` |
| Method | AddVertices | 2017 | `public void AddVertices ( IList < VertexPosition > vertices )` |